///<summary>
///Класс реализующий окно изменения сложности игры
///</summary>
///<remarks>Данный класс определён только для одиночной игры</remarks>
public class ChangeDifficult
{
  ///<summary>
  ///Текущая сложность игрового процесса
  ///</summary>
  private int tempDifficult;
  ///<summary>
  ///Максимальные рекорд по очкам
  ///</summary>
  private long maxRecord;
  ///<summary>
  ///Конструктор класса, который создает окно
  ///</summary>
  public ChangeDifficult(){
    //загрузка окна изменения сложности игры (только одиночная игра)
  }
  ///<summary>
  ///Метод изменения сложности игры
  ///</summary>
  public void changedDifficult(){
    //метод изменения сложности игры
  }
  ///<summary>
  ///Метод, который устанавливает сложность в зависимости от ползунка,<br/>
  ///а также реализует возможность изменения этого ползунка.
  ///</summary>
  public void changedSliderDifficult(){
    //изменение ползунка сложности игры
  }
  ///<summary>
  ///Метод обработки кнопки "Назад"
  ///</summary>
  public void buttonExit(){
    //метод обработки нажатия кнопки "назад"
  }
  ///<summary>
  ///Метод обработки кнопки "Начать игру"
  ///</summary>
  public void buttonStart(){
    //обработка нажатия кнопки "Начать игру"
  }
  ///<summary>
  ///Другие методы, которые необходимы для корректной работы
  ///</summary>
  //другие методы
}
