///<summary>
///Класс, который реализует окно меню для одиночной игры
///</summary>
public class OnePlayerMenu
{
  ///<summary>
  ///Параметры для корректной работы
  ///</summary>
  /*некоторые параметры*/
  ///<summary>
  ///Конструктор класса для создания окна меню
  ///</summary>
  public OnePlayerMenu(){
    //загрузка окна одиночной игры
  }
  ///<summary>
  ///Метод обработки нажатия на кнопку "Назад"
  ///</summary>
  public void buttonExit(){
    //обработка нажатия кнопки "назад"
  }
  ///<summary>
  ///Метод обработки нажатия на кнопку "Начать игру"
  ///</summary>
  public void buttonStartGame(){
    //обработка нажатия кнопки "начать игру"
  }
  ///<summary>
  ///Другие методы, которые необходимы для корректной работы
  ///</summary>
  //другие методы
}
